In [4]:
import sqlite3
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
connection = sqlite3.connect('my_database2.db')
%load_ext sql
%sql sqlite:///my_database2.db

In [ ]:
# 1. Провести оценку количества товара на складе по наименованиям: менее 10 – мало,
# от 10 до 100 – достаточно, более 100 – избыточно.

In [15]:
%%sql
SELECT
    Product.name,
    quantity,
    CASE
        WHEN quantity < 10 THEN "мало"
        WHEN quantity BETWEEN 10 AND 100 THEN "достаточно"
        ELSE "избыточно"
    END as state
FROM Store
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100, 'достаточно'),
 ('Ноутбук', 50, 'достаточно'),
 ('Зонтик', 200, 'избыточно'),
 ('Фотоаппарат', 30, 'достаточно'),
 ('Сумка', 0, 'мало'),
 ('Наушники', 100, 'достаточно'),
 ('Книга', 150, 'избыточно')]

In [ ]:
# 2. Вывести наименования товаров, количество которых на складе от 1 до 10.

In [47]:
%%sql
SELECT name, quantity FROM Store
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product
HAVING quantity BETWEEN 1 AND 100

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100),
 ('Ноутбук', 50),
 ('Фотоаппарат', 30),
 ('Наушники', 100)]

In [ ]:
# 3. Определить тройку товаров, выручка за которые самая большая.

In [44]:
%%sql
SELECT Product.name, (Store.price * Deal.quantity) as revenue FROM Deal
INNER JOIN Store ON ID_Store = Store.id
INNER JOIN Product ON ID_Product = Product.id
GROUP BY ID_Product
ORDER BY revenue DESC
LIMIT 3

 * sqlite:///my_database2.db
Done.

[('Ноутбук', 6400), ('Футбольный мяч', 250)]

In [1]:
# Определить суммарную стоимость продаж каждого товара по месяцам.

In [36]:
%%sql
SELECT 
    Product.name, 
    strftime('%Y', Deal.date) as year, 
    strftime('%m', Deal.date) as month, 
    price 
FROM Deal
INNER JOIN Store ON ID_Store = Store.id
INNER JOIN Product ON ID_Product = Product.id
GROUP by month
ORDER BY year, month

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', '2025', '01', 55),
 ('Футбольный мяч', '2025', '02', 50),
 ('Футбольный мяч', '2025', '03', 50),
 ('Зонтик', '2025', '07', 15),
 ('Фотоаппарат', '2025', '08', 1200),
 ('Фотоаппарат', '2025', '09', 1250),
 ('Ноутбук', '2025', '10', 800),
 ('Футбольный мяч', '2025', '11', 50),
 ('Футбольный мяч', '2027', '06', 55),
 ('Ноутбук', '2028', '05', 800),
 ('Ноутбук', '2029', '04', 800)]

In [63]:
%%sql
SELECT 
    Product.name, 
    strftime('%Y', Deal.date) as year, 
    CASE
        WHEN strftime('%m', Deal.date) = "01" THEN "Январь"
        WHEN strftime('%m', Deal.date) = "02" THEN "Февраль"
        WHEN strftime('%m', Deal.date) = "03" THEN "Март"
        WHEN strftime('%m', Deal.date) = "04" THEN "Апрель"
        WHEN strftime('%m', Deal.date) = "05" THEN "Май"
        WHEN strftime('%m', Deal.date) = "06" THEN "Июнь"
        WHEN strftime('%m', Deal.date) = "07" THEN "Июль"
        WHEN strftime('%m', Deal.date) = "08" THEN "Август"
        WHEN strftime('%m', Deal.date) = "09" THEN "Сентябрь"
        WHEN strftime('%m', Deal.date) = "10" THEN "Октябрь"
        WHEN strftime('%m', Deal.date) = "11" THEN "Ноябрь"
        WHEN strftime('%m', Deal.date) = "12" THEN "Декабрь"
        ElSE "Неизвестный месяц"
    END as monthName,
    price 
FROM Deal
INNER JOIN Store ON ID_Store = Store.id
INNER JOIN Product ON ID_Product = Product.id
GROUP by monthName
ORDER BY year, Deal.date

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', '2025', 'Январь', 55),
 ('Футбольный мяч', '2025', 'Февраль', 50),
 ('Футбольный мяч', '2025', 'Март', 50),
 ('Зонтик', '2025', 'Июль', 15),
 ('Фотоаппарат', '2025', 'Август', 1200),
 ('Фотоаппарат', '2025', 'Сентябрь', 1250),
 ('Ноутбук', '2025', 'Октябрь', 800),
 ('Футбольный мяч', '2025', 'Ноябрь', 50),
 ('Футбольный мяч', '2027', 'Июнь', 55),
 ('Ноутбук', '2028', 'Май', 800),
 ('Ноутбук', '2029', 'Апрель', 800)]

In [64]:
%%sql
SELECT 
    Product.name, 
    strftime('%Y', Deal.date) as year, 
    CASE
        WHEN strftime('%m', Deal.date) = "01" THEN "Январь"
        WHEN strftime('%m', Deal.date) = "02" THEN "Февраль"
        WHEN strftime('%m', Deal.date) = "03" THEN "Март"
        WHEN strftime('%m', Deal.date) = "04" THEN "Апрель"
        WHEN strftime('%m', Deal.date) = "05" THEN "Май"
        WHEN strftime('%m', Deal.date) = "06" THEN "Июнь"
        WHEN strftime('%m', Deal.date) = "07" THEN "Июль"
        WHEN strftime('%m', Deal.date) = "08" THEN "Август"
        WHEN strftime('%m', Deal.date) = "09" THEN "Сентябрь"
        WHEN strftime('%m', Deal.date) = "10" THEN "Октябрь"
        WHEN strftime('%m', Deal.date) = "11" THEN "Ноябрь"
        WHEN strftime('%m', Deal.date) = "12" THEN "Декабрь"
        ElSE "Неизвестный месяц"
    END as monthName,
    price 
FROM Deal
INNER JOIN Store ON ID_Store = Store.id
INNER JOIN Product ON ID_Product = Product.id
WHERE price < 54 AND Product.id = 1
GROUP by monthName
ORDER BY year, Deal.date

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', '2025', 'Январь', 50),
 ('Футбольный мяч', '2025', 'Февраль', 50),
 ('Футбольный мяч', '2025', 'Март', 50),
 ('Футбольный мяч', '2025', 'Ноябрь', 50)]